# 'brew tap'
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/services"

# Set argument for all 'brew cask install' command
cask_args appdir: "/Applications"

# 'brew install'
brew "git"
brew "go"
brew "gotop"
brew "kubernetes-cli"
brew "neofetch"
brew "nvm"
brew "postgresql"
brew "pyenv"

# 'brew casks install'
cask "1password"
cask "alfred"
cask "appcleaner"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "kap"
cask "notion"
cask "pgadmin4"
cask "postman"
cask "slack"
cask "spotify"
cask "typora"
cask "visual-studio-code"
cask "vlc"
