# Set argument for all 'brew cask install' command
cask_args appdir: "/Applications"

# taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

# formulae
brew "asdf"
brew "bat"
brew "gh"
brew "git"
brew "go"
brew "jq"
brew "kubernetes-cli"
brew "neovim"
brew "postgresql"
brew "powerlevel10k"
brew "rg"
brew "tree"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completion"
brew "zsh-syntax-highlighting"

# casks
cask "1password"
cask "alt-tab"
cask "devutils"
cask "docker"
cask "firefox"
cask "font-fira-mono-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "kap"
cask "pgadmin4"
cask "postman"
cask "slack"
cask "spotify"
cask "visual-studio-code"
